[
  {
    "content": "I Amp Currently studying for tomorrow's test on electricity.",
    "category": "PHYSICS"
  },
  {
    "content": "Circular motion is a tough unit, I'm not getting anywhere even after 3 hours of studying.",
    "category": "PHYSICS"
  },
  {
    "content": "I tried teaching my brother fractions today, he couldn't understand Half of what I was saying",
    "category": "MATH"
  },
  {
    "content": "I can't teach him Calculus yet, he has his Limits.",
    "category": "MATH"
  },
  {
    "content": "What do you call a good program? An .execellent program.",
    "category": "COMP-SCI"
  },
  {
    "content": "Take Note of the accidentals in this section, it's quite tricky.",
    "category": "MUSIC"
  },
  {
    "content": "Teach me trig, sin[π]!",
    "category": "MATH"
  },
  {
    "content": "I have Terable news, my computer Ram out of memory.",
    "category": "COMP-SCI"
  },
  {
    "content": "The chem test was brutal. The teacher showed absolutely no Enthalpy.",
    "category": "CHEMISTRY"
  },
  {
    "content": "Your balance has been Reduced due to the Charges placed on your account.",
    "category": "CHEMISTRY"
  },
  {
    "content": "There are a Variety of theories on Meiosis.",
    "category": "BIOLOGY"
  },
  {
    "content": "You took Olive my good jokes about Vegetables!",
    "category": "OTHER"
  },
  {
    "content": "Too much programming has made me C-sick.",
    "category": "COMP-SCI"
  },
  {
    "content": "Being a neutrino is tough, they go through so much in life.",
    "category": "PHYSICS"
  },
  {
    "content": "How does data move around in a computer? With the Universal Serial Bus.",
    "category": "COMP-SCI"
  },
  {
    "content": "If you work with a partner in biology class, don't they become your Life partner?",
    "category": "BIOLOGY"
  },
  {
    "content": "Sometimes I just don't know what I'm thinking, my head has a mind of its own...",
    "category": "OTHER"
  },
  {
    "content": "What does a percussionist on drugs say? Where did my Bongo?",
    "category": "MUSIC"
  },
  {
    "content": "If you run out of oxygen while scuba diving, you're in Deep trouble",
    "category": "OTHER"
  },
  {
    "content": "I had a test on explosive chemicals today, Bombed it",
    "category": "CHEMISTRY"
  },
  {
    "content": "I love kinematics graphs, I'm really good a-t them.",
    "category": "PHYSICS"
  },
  {
    "content": "My chem teacher want me to make a molecular model, But I don't have the Balls to do it.",
    "category": "CHEMISTRY"
  },
  {
    "content": "I want to drop my assignment on the ground so gravity can so do some of the Work for me.",
    "category": "PHYSICS"
  },
  {
    "content": "I hate decimals, they just don't Float my boat.",
    "category": "COMP-SCI"
  },
  {
    "content": "If you can't play in the band, then Rest in Piece to you.",
    "category": "MUSIC"
  },
  {
    "content": "Study vectors hard, or you will lose your sense of Direction.",
    "category": "MATH"
  },
  {
    "content": "How many questions did you get on the geography test for Canada? I got Nunavut.",
    "category": "GEO"
  },
  {
    "content": "If I make physics jokes would you understand the Reference?",
    "category": "PHYSICS"
  },
  {
    "content": "How do chemists see in the dark? With Electro-lights.",
    "category": "CHEMISTRY"
  },
  {
    "content": "Your music jokes are terrible, get Bach to me once you come up with something good.",
    "category": "MUSIC"
  },
  {
    "content": "Did you like the lesson on Fungi? I'm Lichen it so far.",
    "category": "BIOLOGY"
  },
  {
    "content": "We had a geometry test today, everybody got Rect.",
    "category": "MATH"
  },
  {
    "content": "Your jokes are trash, Litterally.",
    "category": "OTHER"
  },
  {
    "content": "I was wondering how springs work, then it Hit me.",
    "category": "PHYSICS"
  },
  {
    "content": "Not trying to be Mean but you are just an Average student.",
    "category": "MATH"
  },
  {
    "content": "We are supposed to know the properties of springs but all people think about is summer.",
    "category": "PHYSICS"
  },
  {
    "content": "Your bad trig jokes are really getting Repetitive.",
    "category": "MATH"
  },
  {
    "content": "I need to do well in trig to show my teacher that I am a Radian-t student.",
    "category": "MATH"
  },
  {
    "content": "On Halloween, everyone in my math class yelled 'Trig or Treat!'",
    "category": "MATH"
  },
  {
    "content": "Just put it on the ground, let µ do all the work.",
    "category": "PHYSICS"
  },
  {
    "content": "I bombed my vectors test, but my mark still went up... by -5%.",
    "category": "MATH"
  },
  {
    "content": "You guys can't be in my team, you're Allies.",
    "category": "OTHER"
  },
  {
    "content": "What's a percussionist's favourite mathematical function? LogaRythms",
    "category": "MUSIC/MATH"
  },
  {
    "content": "I don't like guitar players, they are always so Picky.",
    "category": "MUSIC"
  },
  {
    "content": "You're playing too loud! No, I'm playing Piano.",
    "category": "MUSIC"
  },
  {
    "content": "What do you call the act of stealing saxophones? Grand theft Alto.",
    "category": "MUSIC"
  },
  {
    "content": "Help me make a nuclear reactor. Sorry, no CANDU.",
    "category": "PHYSICS"
  },
  {
    "content": "We learned about Cellular respiration today, I didn't know my phone needed to breathe...",
    "category": "BIOLOGY"
  },
  {
    "content": "What do you call an identity that can't be solved? A Tricknometric identity.",
    "category": "MATH"
  },
  {
    "content": "Trudeau is such a player, he has so many people in his Cabinet.",
    "category": "OTHER"
  },
  {
    "content": "How do ducks solve math problems? Using the Quackdratic formula.",
    "category": "MATH"
  },
  {
    "content": "What's the difference between a student and a camera? A camera can Focus.",
    "category": "OTHER"
  },
  {
    "content": "How do ducks hack computers? They Quack the code.",
    "category": "COMP-SCI"
  },
  {
    "content": "Sushi is very SuFishticated.",
    "category": "OTHER"
  },
  {
    "content": "I was trying to teach my brother Trigonometric graphs but he Phased out on me.",
    "category": "MATH"
  },
  {
    "content": "We finally started learning Special Relativity, it's about Time!",
    "category": "PHYSICS"
  },
  {
    "content": "Why do you hate using Straws? Because they Suck.",
    "category": "OTHER"
  },
  {
    "content": "How were the Lamb chops? Meh.",
    "category": "Other"
  },
  {
    "content": "I like Linear systems, they are very Straight forward.",
    "category": "MATH"
  },
  {
    "content": "When two good math students work together, they become 2good.",
    "category": "MATH"
  },
  {
    "content": "What's an elephant's favourite instrument? A Trunkpet.",
    "category": "MUSIC"
  },
  {
    "content": "Why are drummers always the ones that keep time? Because they are UnBeatable.",
    "category": "MUSIC"
  },
  {
    "content": "What do you call a snail in space? A Gastronaut.",
    "category": "BIOLOGY"
  },
  {
    "content": "What do you call a snail not in space? A GastroNOT.",
    "category": "BIOLOGY"
  },
  {
    "content": "What does the Fox say? I don't care, no Fox given.",
    "category": "OTHER"
  },
  {
    "content": "People who like Sushi tend to get high because they often Seaweed.",
    "category": "OTHER"
  },
  {
    "content": "We're out of Beef, we are in a Steak of emergency!",
    "category": "OTHER"
  },
  {
    "content": "Oil prices are Rigged.",
    "category": "OTHER"
  },
  {
    "content": "If 420 is not high enough, try 420!",
    "category": "MATH"
  },
  {
    "content": "I love trigonometry, it feels like Secant nature to me.",
    "category": "MATH"
  },
  {
    "content": "Nice house! Thanks, don't Mansion it.",
    "category": "OTHER"
  },
  {
    "content": "I was writing deep messages, took a while to Sink in.",
    "category": "OTHER"
  },
  {
    "content": "I only carry small flashlights are they are Light weight.",
    "category": "OTHER"
  },
  {
    "content": "The Optics test Seemed easy, but it was just an Illusion.",
    "category": "PHYSICS"
  },
  {
    "content": "Pop exploding is an example of a Fizzical change.",
    "category": "PHYSICS"
  },
  {
    "content": "Let's play a Star Wars song! It's quite Duelble.",
    "category": "OTHER"
  },
  {
    "content": "What instrument does a pool player play? A cue stick guitar.",
    "category": "MUSIC"
  },
  {
    "content": "What do musicians say when they mess up a note? Son of a Pitch.",
    "category": "MUSIC"
  },
  {
    "content": "What do you all a train that sneezes? Achoo-choo train.",
    "category": "OTHER"
  },
  {
    "content": "Bomb defusing is so intense, it comes down to the Wire every time.",
    "category": "OTHER"
  },
  {
    "content": "He must be a math genius, his solutions are on Point.",
    "category": "MATH"
  },
  {
    "content": "My friend was Wine-ing after he got ticketed for drinking and driving, so I told him to just Beer with it.",
    "category": "OTHER"
  },
  {
    "content": "It's just a toy car, there's nothing to Ride home about.",
    "category": "OTHER"
  },
  {
    "content": "What can you conclude upon seeing someone crying in math class? They did too much Sobtraction.",
    "category": "MATH"
  },
  {
    "content": "How did you get so many bruises just from shopping?! Because it's Boxing day!",
    "category": "OTHER"
  },
  {
    "content": "My school's bell was broken today, it was so quiet. I guess it deserves the No Bell Peace prize.",
    "category": "OTHER"
  },
  {
    "content": "Why do lumberjacks always seem annoyed? Because people Axe them too many questions.",
    "category": "OTHER"
  },
  {
    "content": "You should .com visit my website.",
    "category": "OTHER"
  },
  {
    "content": "I thought having 2 brains would be a good thing, now I'll have to think Twice on that.",
    "category": ""
  },
  {
    "content": "Sorry, broken scissors just won't Cut it for me.",
    "category": "OTHER"
  },
  {
    "content": "I never use my vacuum because it Sucks.",
    "category": "OTHER"
  },
  {
    "content": "I'm a attractive lab monitor because when I enter the room, all the computers gets turned on.",
    "category": "OTHER"
  },
  {
    "content": "I went to shop for a boat today, it was on Sail!",
    "category": "OTHER"
  },
  {
    "content": "I'm pregnant... What?! You've got to be Kid-in-me!",
    "category": "OTHER"
  },
  {
    "content": "I'm so good at sleeping that I can do it with my eyes closed!",
    "category": "OTHER"
  },
  {
    "content": "How loud should I play this note? Forte decibels.",
    "category": "PHYSICS/MUSIC"
  },
  {
    "content": "Why do photons never notice me? They got no Time.",
    "category": "PHYSICS"
  },
  {
    "content": "In Einstein's world, the biggest question is: 2c or not 2c?",
    "category": "PHYSICS"
  },
  {
    "content": "I don't need to tell you how good these mics are, they speak for themselves!",
    "category": "OTHER"
  },
  {
    "content": "I love graphing, but for some people, graphing is where they draw the Line.",
    "category": "MATH"
  },
  {
    "content": "Did you see the video on the new strand of bacteria they discovered? It's Spreading across the web!",
    "category": "BIOLOGY"
  },
  {
    "content": "I hate the floor function, it lets me Down every time.",
    "category": "MATH"
  },
  {
    "content": "I hate fixing windows, it's a Pane.",
    "category": "OTHER"
  },
  {
    "content": "Pikachu is Grounded for electrocuting his friends.",
    "category": "OTHER"
  },
  {
    "content": "Do not get close to the angry computer! It will Byte!",
    "category": "COMP-SCI"
  },
  {
    "content": "You watched 'Finding Nemo' already? I've been looking for it everywhere!",
    "category": "OTHER"
  },
  {
    "content": "Can I borrow you hammer? Sure, knock yourself out.",
    "category": "OTHER"
  },
  {
    "content": "What do people learn in bio class? The endocrying system",
    "category": "BIOLOGY"
  },
  {
    "content": "I went to see this drama production on puns today, it was a play on words.",
    "category": "OTHER"
  },
  {
    "content": "With great power, comes with great resPunsibility",
    "category": "OTHER"
  },
  {
    "content": "What's your favourite sport? Ping-Pun.",
    "category": "OTHER"
  },
  {
    "content": "Confusing physics question: A high speed boat is moving at sea at c, what do you see?",
    "category": "PHYSICS"
  },
  {
    "content": "He said the car ride only lasts for 5 minutes, but he got carried away.",
    "category": "OTHER"
  },
  {
    "content": "E = mc² is a weapon of Mass destruction.",
    "category": "PHYSICS"
  },
  {
    "content": "Mr.Schrödinger, how would you like it? Crispy or grilled? Why not both?",
    "category": "PHYSICS"
  },
  {
    "content": "Why do you drink so much like your dad? I guess it Rums in the family.",
    "category": "OTHER"
  },
  {
    "content": "Now I know why I kill every math test, I have a Sharp calculator.",
    "category": "MATH"
  },
  {
    "content": "Why are photography test questions always out of 3? Because it's the rule of 3rds.",
    "category": "OTHER"
  },
  {
    "content": "The font you choose for memes has a big Impact on its outcome.",
    "category": "OTHER"
  },
  {
    "content": "Ahh tape doesn't work, I'll just Stick with glue.",
    "category": "OTHER"
  },
  {
    "content": "How do you calculate the net force on a ship? Mast times acceleration.",
    "category": "PHYSICS"
  },
  {
    "content": "After seeing my friend's new handsome hair style, I feel gel less.",
    "category": "OTHER"
  },
  {
    "content": "Did you hear Bruno Mars's song Grenade? Yea, it Blows.",
    "category": "OTHER"
  },
  {
    "content": "What do you call those explained forces in non-inertial frames of references? Faketicious forces.",
    "category": "PHYSICS"
  },
  {
    "content": "Our country have stopped using coins, they said it's time for Change.",
    "category": "OTHER"
  },
  {
    "content": "Why is your whole family bald? InHairitance.",
    "category": "OTHER"
  },
  {
    "content": "What is the similarity between women and Pi? They both go on and on.",
    "category": "OTHER"
  },
  {
    "content": "I failed my quiz on the alphabet, the only letter I got was F.",
    "category": "OTHER"
  },
  {
    "content": "Whoa he told the truth for once, that was Honestpected.",
    "category": "OTHER"
  },
  {
    "content": "The happiest vegetable is the Ha-lapeno.",
    "category": "OTHER"
  },
  {
    "content": "I have a Limited edition Calculus textbook.",
    "category": "MATH"
  },
  {
    "content": "I can't find this limit, I hope l'Hôpital's rule will give us an Aid",
    "category": "MATH"
  },
  {
    "content": "Until your child is born, whoever the father is will not be A parent.",
    "category": "OTHER"
  },
  {
    "content": "How does Iodine ask Oxygen out? Iodate you.",
    "category": "CHEMISTRY"
  },
  {
    "content": "When I tried to shop for a Ford online, it said 'Ford O Ford error, car not found'",
    "category": "OTHER"
  },
  {
    "content": "A bird that can't fly? For Rio??",
    "category": "OTHER"
  },
  {
    "content": "Two statisticians tied at 1-1 in a game, I guess they broke even.",
    "category": "MATH"
  },
  {
    "content": "You can't just calculate the limit directly, you have to take on a different Approach.",
    "category": "MATH"
  },
  {
    "content": "IOnly use standard input and output.",
    "category": "COMP-SCI"
  },
  {
    "content": "Brain surgery is only done on someone who's every open minded.",
    "category": "OTHER"
  },
  {
    "content": "I wasn't here for music class today, were there any notes? Yes... A LOT.",
    "category": "MUSIC"
  },
  {
    "content": "Our calc class needs us because there's no Calculus without 'us'.",
    "category": "MATH"
  },
  {
    "content": "Programmers never get good marks cause they always get C or C+ on their tests.",
    "category": "COMP-SCI"
  },
  {
    "content": "Programmers' favourite food? C food.",
    "category": "COMP-SCI"
  },
  {
    "content": "I like working with glue because it always sticks to my plan.",
    "category": "OTHER"
  },
  {
    "content": "I don't know what frequency she is screaming at but it Hertz my ears.",
    "category": "PHYSICS"
  },
  {
    "content": "I don't C the point of integrating.",
    "category": "MATH"
  },
  {
    "content": "What's a black board's favourite snack? Chalkolate.",
    "category": "OTHER"
  },
  {
    "content": "Where do cats eat? In the Catfeteria.",
    "category": "OTHER"
  },
  {
    "content": "My philosophy idea failed... It's ok, it's the thought that counts.",
    "category": "PHILOSOPHY"
  },
  {
    "content": "The most common choices on a biology multiple choice test are DNA.",
    "category": "BIOLOGY"
  },
  {
    "content": "While the most common choices on a math multiple choice test are DNE.",
    "category": "MATH"
  },
  {
    "content": "Protractors are always depressed because they can never find their other half.",
    "category": "MATH"
  },
  {
    "content": "Wanna help me make a nuke? I can't do it without U.",
    "category": "PHYSICS/CHEMISTRY"
  },
  {
    "content": "Did you how I managed to escape Iraq? Iran.",
    "category": "GEO"
  },
  {
    "content": "Our calculus teacher assigned all the homework to optimize our learning.",
    "category": "MATH"
  },
  {
    "content": "Find the acceleration of the car a(t) 2 seconds.",
    "category": "t)"
  },
  {
    "content": "Out of the 26 of you, only 3 made the cut: 'c', 'u' and 't'.",
    "category": "OTHER"
  },
  {
    "content": "Breaking News: Truck runs into glassware store.",
    "category": "OTHER"
  },
  {
    "content": "You know what doesn't make Cents? Pennies.",
    "category": "OTHER"
  },
  {
    "content": "Our school removed all the black boards, but the one bright side, we got new white boards instead.",
    "category": "OTHER"
  },
  {
    "content": "My hand-made rubber band gun sure comes in Handy.",
    "category": "OTHER"
  },
  {
    "content": "All my math tests are messy because there's Pi everywhere.",
    "category": "MATH"
  },
  {
    "content": "If the English language could stop having sew many words that sound the same that wood be grate.",
    "category": "OTHER"
  },
  {
    "content": "I love lawyers, they Rule.",
    "category": "OTHER"
  },
  {
    "content": "Before music existed, no one thought the world would Bb.",
    "category": "MUSIC"
  },
  {
    "content": "How wast he movie Shrek? Meh, so so, mediogre.",
    "category": "OTHER"
  },
  {
    "content": "Mr.Boomerang we can't serve you right now, please come back later.",
    "category": "OTHER"
  },
  {
    "content": "My best physics student fell off a cliff, he had so much potential...",
    "category": "PHYSICS"
  },
  {
    "content": "At one point in time, I was addicted to my Calculus homework.",
    "category": "MATH"
  },
  {
    "content": "Weeds are growing uncontrollably in my year. Bet you never sow that coming.",
    "category": "OTHER"
  },
  {
    "content": "These headphones are broken, I can't hear jack s**t.",
    "category": "OTHER"
  },
  {
    "content": "What's the name of that Pho place we ate at last time? Uhh... I Pho-got.",
    "category": "OTHER"
  },
  {
    "content": "Don't have an idea on the size of the library? Look at my panorama, you'll get the bigger picture.",
    "category": "OTHER"
  },
  {
    "content": "Seeing three crazy girls moving around in an elevator as they descend to the main floor is wrong on so many levels.",
    "category": "OTHER"
  },
  {
    "content": "Least environmental friendly fuel company? Esso, the combustion release so much Esso 2.",
    "category": "CHEMISTRY"
  },
  {
    "content": "The bright light blinded me, how eyeronic.",
    "category": "OTHER"
  },
  {
    "content": "Why do iPhone users never go to the doctor? Because an Apple a day keeps the doctor away.",
    "category": "OTHER"
  },
  {
    "content": "I almost got shot! Pew, that was close.",
    "category": "OTHER"
  },
  {
    "content": "I bricked my Android phone when I tried to root it, it's a Nokia now.",
    "category": "OTHER"
  },
  {
    "content": "Your runny nose snot my problem.",
    "category": "OTHER"
  },
  {
    "content": "Endless music is the best, I'd rate it 24/7.",
    "category": "OTHER"
  },
  {
    "content": "Jokes about skeletons are so Humerus.",
    "category": "BIOLOGY"
  },
  {
    "content": "Units of acceleration for an osilating object? - Meters per secant squared.",
    "category": "MATH/PHYSICS"
  },
  {
    "content": "Dimonds are rare, so if you find any, seldom to me.",
    "category": "OTHER"
  },
  {
    "content": "I always lose my best erasers beacause they leave no traces behind.",
    "category": "OTHER"
  },
  {
    "content": "A chemistry scholar got his pHDegree.",
    "category": "CHEMISTRY"
  },
  {
    "content": "Don't listen to Drake's music when driving, it's illegal to Drake and drive.",
    "category": "OTHER"
  },
  {
    "content": "I searched up 'Finding Nemo' on Netflix, it said 'No results were found.'",
    "category": "OTHER"
  },
  {
    "content": "Unintended or Punintended? That is the question.",
    "category": "OTHER/SHAKESPEARE"
  },
  {
    "content": "What if Einstein's theory of Relativity was wrong? It's ok, it's the thought that counts.",
    "category": "PHYSICS"
  },
  {
    "content": "Sorry, parallel lines don't meet our requirements.",
    "category": "MATH"
  },
  {
    "content": "What do you major in? Music.",
    "category": "MUSIC"
  },
  {
    "content": "Ikea book shelves don't have instructions... Yea, they are pretty shelf explanatory.",
    "category": "OTHER"
  },
  {
    "content": "I am Chinese and I am cheap, why? Because I'm made in China.",
    "category": "OTHER"
  },
  {
    "content": "The sin law lies, and lying is a sin.",
    "category": "OTHER"
  },
  {
    "content": "Unit for measuring the loudness of an electric guitar? Amps.",
    "category": "PHYSICS/MUSIC"
  },
  {
    "content": "I'm bringing beer to school, it's a quite a whisky move.",
    "category": "OTHER"
  },
  {
    "content": "I forgot how to name Esters...OATE I REMEMEBER!",
    "category": "CHEMISTRY"
  },
  {
    "content": "What's a dog's favourite instrument? A trom-bone.",
    "category": "MUSIC"
  },
  {
    "content": "How do you ask a statistician out? You datum.",
    "category": "MATH"
  },
  {
    "content": "My favourite Green Day song? 21 Puns.",
    "category": "MUSIC"
  },
  {
    "content": "The only things that are right on your test are the corners!",
    "category": "MATH"
  },
  {
    "content": "Learning about the 3rd dimension today in math really stood out to me.",
    "category": "MATH"
  },
  {
    "content": "I showed my crew how to make the invisible suit many times. I thought I made myself clear but they still don't see what I did.",
    "category": "OTHER"
  },
  {
    "content": "What do you call an immigrant zombie? Flesh off the boat.",
    "category": "OTHER"
  },
  {
    "content": "Please don't shoot, I pun in peace.",
    "category": "OTHER"
  },
  {
    "content": "What do you call a fake trophy? A trollphy.",
    "category": "OTHER"
  },
  {
    "content": "We missed the storm, it went right over our heads.",
    "category": "OTHER"
  },
  {
    "content": "What's so great about math commercials? Well the ADs are big pluses.",
    "category": "MATH"
  },
  {
    "content": "U and I should be together. Yeah on a keyboard maybe.",
    "category": "OTHER"
  },
  {
    "content": "Upon hearing that the world is going to end the next day, people are running like there's no tomorrow.",
    "category": "OTHER"
  },
  {
    "content": "My friend skipped his lecture on Integrals, so I summed it up in one line for him",
    "category": "MATH"
  },
  {
    "content": "My friend fell off of a cliff! Oh, mg!",
    "category": "PHYSICS"
  },
  {
    "content": "Let's do a fundraiser for a new microphone, our voices must be heard.",
    "category": "OTHER"
  },
  {
    "content": "My friend subtracted his numbers in the wrong order, it makes a huge difference!",
    "category": "MATH"
  }
]